Чипборд Лійка з квітами 2;б0300;10;6
Чипборд "Відчинене вікно";г0031;10;11
Чипборд "Аліса в країні чудес";а0041;10;8
Чипборд "Стопка чашек";а0049;10;6
Чипборд Набір "Чайники і пляшка";а0038;10;6
Чипборд "В'язка ключів" (мал.);а0030;10;5
Чипборд "Казкові гриби" (мал.);а0019;10;6
Чипборд Завиток із листям малий;з0129;10;6
Чипборд Гілка з квіточками;б0426;10;5
Чипборд "Гілка ягідна";б0265;10;6
Чипборд Казковий кульбаба;б0255;10;6
Чипборд Гілка вийна кобея;б0197;10;5
Чипборд Набір "Пер'я бохо";б0067;10;7
Чипборд Набір "Вінтажні ліхтарі";г0011;10;7
Чипборд "Вуличний ліхтар";г0010;10;6
Чипборд Набір стрілочки диво;дб0152;5;6
Набір "Важкі дрібниці" з іконками;дб0135;5;52
Чипборд "Повітряні кулі";дб0004;10;5
Чипборд Мамині скарби з завитками 3;дб0138;5;15
Чипборд "Коляска мала";дб0013;10;7
Чипборд Бодік з серцем;дб0151;10;5
Чипборд "Ліжечко і підвіска";дб0072;10;6
Чипборд Набір лампочки 1;;10;8
Чипборд "Аист із малюком";дб0073;10;6
Чипборд "Прапорці 2";;10;5
Чипборд Набір лампочки 3 ;;10;8
Чипборд Рамка прямокутна "Цепі";сп0033;5;14
Чипборд Стипанк декор 2;;5;12
Чипборд Підвіска Цепі з шестернями (ліва);;5;12
Чипборд Шестерні суцільні — 1;;5;7
Чипборд "Ціп по колу";;5;8
Чипборд Паражин і наречена ;;10;5
Чипборд Наше весілля;св0105;5;15
Чипборд "Серце з коронкою" (мал.);;10;5
Чипборд "Серце з коронкою" (бол.);;10;5
Чипборд "Love";009-4;10;6
Чипборд "Підвіска сердечка";;5;5
Чипборд Набір хмаринок;;10;4
Чіпборд Пара голубів;св0106;10;5
Чипборд Набір "Кульки ажурні";р0187;10;5
Чипборд Набір "Ключики і замочки";;5;16
Чипборд Телефон;213-4;10;6
Чипборд "Лелека двійня";дб0093;5;6
Чипборд Олень 3;зв0083;5;6
Чипборд "Годинник ажурні";а0012;5;14
Чипборд Набір шпильки з зірочками;дб0147;10;6
Чипборд "Love";;10;3
Чипборд "Ковзани" 2;;5;8
Чипборд "Кільця 2" з діамантом;св0104;10;5
Чипборд "Пташки ";зв0069;10;5
Чипборд "Свічка";нг0185;10;6
Чипборд Пляшка з тегом "Випий мене";а0032;10;5
Чипборд бордюр із листям;б0410;5;10
Чипборд Кекс із тегом "З'їж мене";а0033;10;6
Чипборд Улюбленої мамі в колі з квітами;;5;10
Чипборд маленький принц ;;5;10
Чипборд Набір "12 місяців";;5;30
Чипборд Набір бордюри з квітами;з0102;5;7
Чипборд Набір англійських написів;;5;13
Чипборд Набір написів для дитячого альбому " для хлопчика, укр. мова;дб0153;5;50
Чипборд Набір В'язання;;3;30
Чипборд Набір Швачка;;3;20
Чипборд Набір Швейна машинка;;3;17
Чипборд Напис Baby Book;н0482;5;12
Чипборд набір шестерні ;;10;8
Чипборд Напис Альбом із трояндами ;;5;10
Чипборд набір шестерні 2;;10;8
Чипборд Напис Історія Сім'ї;;5;9
Чипборд напис Вітаємо з завитком;н0516;5;9
Чипборд Напис Наша донечка;н501;5;8
Чипборд настінний годинник;;5;15
Чіпборд Підвіска крапелька велика;;5;13
Чипборд Підвіска Цепі з шестернями (права);;3;12
Чіпборд Підвіска крапельки 2;;5;11
Чипборд Рамка подвійна з сніжинками;нг0130;5;12
Чипборд Рамка Стипанк із шестернями ;рам0107;3;15
Чипборд Птиці на гілочці;зв0079;10;4
Чипборд ліхтарик 2;;5;6
Чипборд Стипанк декор 1;сп0041;3;12
Чипборд Скриня 2;;3;10
Чипборд Різдвяна Банку;;5;10
Чипборд Ліхтарик з зірками;;5;6
Чипборд Ліхтарик 3;;5;7
Чипборд Шейкер Алмаз;ш0017;5;25
Підкладки кола під анкера;;10;13
Чипборд Фішка ніжки 1;дб0142;10;4
Чипборд Соска;дб0149;10;5
Чипборд Підвіска весільна "Голуби";св0100;5;10
Чипборд Серце з трояндами 2;б0288;5;10
Чипборд Наряд наречений і наречена;;3;32
Чипборд квадратна Рамка маленька;рам0018;5;8
Чипборд прямокутна Рамка з сніжинками;рам0020;5;12
Чипборд "Вікно з закругленими склом";г0022;5;6
Чипборд Набір" Прапорці";р0160;5;7
Чипборд З Днем нарождення;н0478;5;6
Чипборд "Вікно з аркою";г0023;5;5
Чипборд Мамині скарби з завитками 4;дб0139;5;11
Чипборд "Закохана пара. Весілля";;5;5
Чипборд "Закохана пара. Поцілунок";;5;5
Планшетка для сушіння квітів подвійна;инс-002;3;50
Чипборд Піратські прапори;;5;8
Чипборд Ром;;5;5
Чипборд Штурвал з ланцюгами;;5;10
Чипборд Якір з ланцюгом;пи0005;5;7
Чипборд Морські зірки;;5;6
Чипборд фотоплівка;;10;7
Чипборд Повітряні кулі;;10;5
Чипборд Набір "Морський світ";;5;23
Чипборд Напис "Улюблені рецепти";к0029;5;6
Чипборд набір Лаванда 001;лав001;5;35
Чипборд "Вагітна";дб0015;10;5
Чипборд "Борщ" Гравірування;к0041;5;10
Чипборд "Перчик" Гравірування;к0042;5;5
Чипборд Тортик зі свічками;к0048;10;6
Чипборд Набір "Веселі каструльки";к0044;5;12
Чипборд Гравірування "Спеції";к0040;5;10
Чипборд Набір Морозиво в стаканчику;к0055;10;7
Чипборд Кекс 2;к0053;10;6
Чипборд Набір чайничків;к0057;10;5
Чипборд Набір Кухонне приладдя;;5;12
Чипборд Баночка 2;;10;6
Чипборд Набір "Чайнички";к0015;5;8
Чипборд Баночка;;10;5
Чипборд Чайник із завитками;к0014;10;6
Чипборд Кекс з вишенькою (бол.);к0024;10;6
Чипборд прямокутна Рамка маленька;рам0019;5;6
Чипборд Рамка Кругла із завитком 3д;рам0116;5;13
Чипборд великої завиток із листям;б0409;5;8
Чипборд "Підвіска дитяча з зайчиком "Boy";дб0124;10;8
Чипборд гілка з ягодами;б0429;5;8
Набір Чипборд "Ліхтарі";г0007;10;8
Гілка з завитками 5;б0340;5;8
Чипборд гілка фрезія 2;б0424;5;8
Чипборд "Дерев'яна хвіртка";а0009;5;8
Чипборд Вінок з гілками і листям;б0322;5;14
Чипборд Мильні бульбашки малий набір;р0205;5;10
Набір Чипборд "Грудничек";дб0024;10;10
Чипборд набір квітучі гілки;б0399;5;11
Чипборд набір ягідні гілочки;б0419;5;11
Чипборд Набір "Весільна арка";св0096;10;26
Чипборд набір кленові листочки;б0414;10;6
Чипборд Вікно 1, 3д;20116-39-2;5;14
Чипборд Вікно 2, 3д;20116-40-2;5;14
Чипборд Вікно 1, 3д;20116-39-1;5;27
Чипборд Двері, 3д;20116-41;5;27
Чипборд Вікно зі ставнями 2;г0038;5;14
Чипборд Вікно зі ставнями + віконниці 1;г0037;5;25
Чипборд Рамка півшароїд "Moment";рам0156;5;8
Чипборд Рамка півшароїд "Love";рам0154;5;8
Чипборд Рамка "Зіркаспад";рам0108;5;10
Чипборд Рамка "Вінтажна овал";рам0092;5;12
Чипборд Рамка кругла із завитками ;рам0071;5;13
Чипборд Рамка серця в завитках горизонтальна;рам0070;5;14
Чипборд рамка "Орбіта мала";рам0041-2;5;6
Чипборд рамка півшароїд із серцем;рам0026;5;7
Набір Чипборд рамки квадратні хвилясті 2;рам0048;10;7
Чипборд "Рамка дзеркальна 2";рам0045;5;11
Чипборд набір лаванда маленька;Лав005;5;26
Чипборд Набір "Космонавт";дб0102;5;18
Чипборд Надпись "Сімейний альбом";н0028;10;6
Чипборд набір Жучки 2;190213-3;5;40
Чипборд Набір "Дитинство";дб0010;5;25
Чипборд "Платьиця з серцем";дб0035;10;6
Чипборд "Хмарка з зірочками";дб0025;10;5
Чипборд Гілка з завитками 1;з0130;10;8
Чипборд Набір "кедрові Шишки" 2;нг0153;10;6
Чипборд "Ялинова шишка";нг0098;10;8
Чипборд Підвіска дитячий бодік;дб0005;5;12
Чипборд Набір "Зірки" 2;дб0053;10;5
Фоновий чипборд "Вітражний";а0001;5;18
Чипборд Гілка квіткова;б0242;5;9
Чипборд "Рукавички";;5;8
Чипборд Гілка чайного дерева;б0384;10;7
Чипборд "Гілка сосни";нг0154;10;6
Чипборд Курча;р0001;10;5
Чипборд "Зайчик на місяці";зв0072;10;8
Чипборд "Зірка" для шейкера;;10;6
Чипборд Завиток "Ритм серця";з0008;10;6
Чипборд "Серце строчка";;10;5
Чипборд Годинник магнолія з ялиною;;5;30
Чипборд Гілка завиток;з0131;10;7
Чипборд Набір слів для скарбів з іконками;н0498;5;40
Чипборд "Вензель";нг0172;10;5
Чипборд "Ліхтар подвійний";г0009;10;6
Чипборд "Чеширський кіт";а0027;5;10
Чипборд Набір "Туфельки з бантиком";дб0076;5;6
Чипборд весняний Вінок з квіточками;б0184;10;6
Чипборд "Коник";дб0068;10;5
Чипборд Напис Вітаємо;;10;4
Чипборд напис Наш синочок;;10;8
З Днем народження;;10;6
Чипборд Напис - Від усього серця;;10;7
Чипборд Напис Вітаю 6;;10;5
Чипборд "Часи";р0181;5;11
Чипборд Рамка Квадратна ажурна;рам0134;5;10
Чипборд "Корота в замок";р0144;5;35
Чипборд Ванна з пухирцями;дб0104;10;6
Чипборд Вікно 2, 3д;20116-40-1;5;27
Чипборд "Підвіска дитяча з зайчиком "Girl";дб0122;10;8
Чипборд набір листя;б0413;10; 7

// let t = Array.from(document.querySelectorAll("div.gs > div > div > div > div > span > blockquote > span > blockquote > span > span > div > table > tbody > tr > td > table > tbody > tr > td > table > tbody > tr > td > table > tbody > tr > td > table > tbody"))
// let r = t.slice(9, -1) 
let t = Array.from(document.querySelectorAll("span > blockquote > span > blockquote > span > span > div > table > tbody > tr > td > table > tbody > tr > td > table > tbody > tr > td > table > tbody > tr > td > table > tbody"))
let r = t.slice(9, -26) 
let l = r.filter((item, index) => index & 1)
let text = l.map(item => item.textContent)
    .map(item => item.split("\n")) 
    .map(item => item.filter(Boolean))
    .map(([name, art, qaunt, cost]) => {
        return [name, art.split(":")[1].trim(), parseFloat(qaunt.split(":")[1].trim()), parseFloat(cost.split(":")[1].trim())]
    })
    .map(item => item.join(";")).join("\n")
